       PROCEDURE DIVISION.
	 COPY in101.
       END PROGRAM p.
       ENVIRONMENT DIVISION.
         CONFIGURATION SECTION.
           SPECIAL-NAMES.
             DECIMAL-POINT IS COMMA.
       PROCEDURE DIVISION.
	 COPY in101.
